# MepAirloopPreheatCoiltype Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepAirloopPreheatCoiltype Property
ParameterTypeId Class See Also
---
"Preheat Coil"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepAirloopPreheatCoiltype { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepAirloopPreheatCoiltype As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepAirloopPreheatCoiltype {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace